InformationRegisters/ЗаявкиНаРегистрациюВЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗаявкиНаРегистрациюВЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОператорЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбменаЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресОрганизацииЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНалоговогоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СертификатПодписанта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеЗаявки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписьЗаявки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеСоглашения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписьСоглашения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаРегистрациюВЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзмененияСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодробноеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПолученияДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимПереходаВЦентрЭДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СертификатыЗаявокНаРегистрациюВЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СертификатыЗаявокНаРегистрациюВЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МЧД003</v8:Type>
						<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОператорыЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОператорыЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбменаЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбменаЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтпечатокСертификата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступноПодключениеЧерез1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправлятьДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаСтраницуТехническойПоддержки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьШаблонСоглашенияНаРоуминг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасширениеФайлаСоглашенияНаРоуминг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействияСоглашенияНаРоуминг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДоступноПодключениеБезОГРН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОднородныйОтветНаВсеДокументыПакета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриРегистрацииПредставителяТребуетсяМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоддерживаемыеПриРегистрацииПредставителяТипыМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеподдерживаемыеФорматы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеКоличествоЭДВПакете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйРазмерПакетаЭД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОшибкиНедействительныхСертификатов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОператора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СертификатыУчетныхЗаписейЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СертификатыУчетныхЗаписейЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДействителенДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.МашиночитаемаяДоверенность</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗаявокНаРегистрациюВЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаРегистрациюВЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сформирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ЗаявкиНаРегистрациюВЭДО/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// Параметры:
//  Идентификаторы - Массив из Строка
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//  * Идентификатор - Строка
//  * Статус - ПеречислениеСсылка.СтатусыЗаявокНаРегистрациюВЭДО
//  * ИдентификаторЭДО - Строка
//  * ПричинаОтклонения - Строка
Функция ВыборкаСостояний(Идентификаторы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаявкиНаРегистрациюВЭДО.Идентификатор,
		|	ЗаявкиНаРегистрациюВЭДО.Статус,
		|	ЗаявкиНаРегистрациюВЭДО.ИдентификаторЭДО,
		|	ЗаявкиНаРегистрациюВЭДО.ПричинаОтклонения
		|ИЗ
		|	РегистрСведений.ЗаявкиНаРегистрациюВЭДО КАК ЗаявкиНаРегистрациюВЭДО
		|ГДЕ
		|	ЗаявкиНаРегистрациюВЭДО.Идентификатор В (&Идентификаторы)";
	
	Запрос.УстановитьПараметр("Идентификаторы", Идентификаторы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * Назначение - Строка
//  * ПодробноеОписание - Строка
//  * ДатаПолученияДокументов - Число
//  * РежимПереходаВЦентрЭДО - Булево
//  * ДолжностиСертификатов - Соответствие из КлючИЗначение:
//    ** Ключ - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//    ** Значение - Строка - Должность
Функция НовыеПараметрыУчетнойЗаписиЭДО() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Назначение", "");
	Параметры.Вставить("ПодробноеОписание", "");
	Параметры.Вставить("ДатаПолученияДокументов", 0);
	Параметры.Вставить("РежимПереходаВЦентрЭДО", Ложь);
	Параметры.Вставить("ДолжностиСертификатов", Новый Соответствие);
	Возврат Параметры;
	
КонецФункции

// Параметры:
//  ПараметрыРегистрации - см. СервисЭДОКлиентСервер.НовыеПараметрыРегистрацииВСервисе1СЭДО
//  ДанныеПакета - см. СервисЭДО.ДанныеДляРегистрационногоПакета1СЭДО
//  ДополнительныеПараметры - см. НовыеПараметрыУчетнойЗаписиЭДО
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * Ошибка - Строка
Функция ЗаписатьЗаявкуНаРегистрациюВЭДО(ПараметрыРегистрации, ДанныеПакета, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Новый Структура("Успех, Ошибка", Ложь, "");
	
	ИдентификаторЗаявки = ПараметрыРегистрации.Идентификатор;
	
	ДоверенностиСертификатов = ПараметрыРегистрации.Доверенности;
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ДолжностиСертификатов = ДополнительныеПараметры.ДолжностиСертификатов;
	Иначе
		ДолжностиСертификатов = Новый Соответствие();
	КонецЕсли;
	
	НаборСертификатовЗаявок = РегистрыСведений.СертификатыЗаявокНаРегистрациюВЭДО.СоздатьНаборЗаписей();
	НаборСертификатовЗаявок.Отбор.ИдентификаторЗаявки.Установить(ИдентификаторЗаявки);
	
	Для Каждого Сертификат Из ПараметрыРегистрации.СертификатыПодписейОрганизации Цикл
		ЗаписьСертификатаЗаявки = НаборСертификатовЗаявок.Добавить();
		ЗаписьСертификатаЗаявки.ИдентификаторЗаявки = ИдентификаторЗаявки;
		ЗаписьСертификатаЗаявки.Сертификат = Сертификат;
		ЗаписьСертификатаЗаявки.Доверенность = ДоверенностиСертификатов[Сертификат];
		ЗаписьСертификатаЗаявки.Должность = ДолжностиСертификатов[Сертификат];
	КонецЦикла;
	
	НаборЗаявок = СоздатьНаборЗаписей();
	НаборЗаявок.Отбор.Идентификатор.Установить(ИдентификаторЗаявки);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(НаборЗаявок.Метаданные().ПолноеИмя());
	ЭлементБлокировки.УстановитьЗначение("Идентификатор", ИдентификаторЗаявки);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		НаборЗаявок.Прочитать();
		
		Если ЗначениеЗаполнено(НаборЗаявок) Тогда
			Результат.Ошибка = СтрШаблон(НСтр("ru = 'Заявка с идентификатором %1 уже существует.'"), ИдентификаторЗаявки);
		Иначе
			ЗаписьЗаявки = НаборЗаявок.Добавить();
			ЗаписьЗаявки.Идентификатор = ИдентификаторЗаявки;
			ЗаписьЗаявки.ОператорЭДО = ПараметрыРегистрации.ОператорЭДО;
			ЗаписьЗаявки.СпособОбмена = Перечисления.СпособыОбменаЭД.ЧерезСервис1СЭДО;
			ЗаписьЗаявки.ИдентификаторЭДО = ПараметрыРегистрации.ИдентификаторОрганизации;
			ЗаписьЗаявки.Организация = ПараметрыРегистрации.Организация;
			ЗаписьЗаявки.АдресОрганизации = ПараметрыРегистрации.АдресОрганизации;
			ЗаписьЗаявки.АдресОрганизацииЗначение = ПараметрыРегистрации.АдресОрганизацииЗначение;
			ЗаписьЗаявки.КодНалоговогоОргана = ПараметрыРегистрации.КодНалоговогоОргана;
			ЗаписьЗаявки.ЭлектроннаяПочта = ПараметрыРегистрации.ЭлектроннаяПочта;
			ЗаписьЗаявки.СертификатПодписанта = ПараметрыРегистрации.СертификатПодписанта;
			ЗаписьЗаявки.ДанныеЗаявки = Новый ХранилищеЗначения(ДанныеПакета.ДвоичныеДанныеДляОператораЭДО);
			ЗаписьЗаявки.ДанныеСоглашения = Новый ХранилищеЗначения(
				ДанныеПакета.ДвоичныеДанныеСоглашенияНаПодключениеЭДО);
			
			Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
				ЗаполнитьЗначенияСвойств(ЗаписьЗаявки, ДополнительныеПараметры);
			КонецЕсли;
			
			ЗаписьЗаявки.Статус = Перечисления.СтатусыЗаявокНаРегистрациюВЭДО.Сформирована;
			ЗаписьЗаявки.ДатаИзмененияСтатуса = ТекущаяДатаСеанса();
			
			НаборЗаявок.Записать();
			НаборСертификатовЗаявок.Записать();
			
			Результат.Успех = Истина;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторЗаявки - см. РегистрСведений.ЗаявкиНаРегистрациюВЭДО.Идентификатор
// 
// Возвращаемое значение:
//  См. УчетныеЗаписиЭДО.НовыеРеквизитыРегистрационногоПакета
Функция РеквизитыРегистрационногоПакета(ИдентификаторЗаявки) Экспорт
	
	ВыборкиДанных = ВыборкиДанныхДляРегистрационногоПакета(ИдентификаторЗаявки);
	ВыборкаРеквизитовЗаявки = ВыборкиДанных.ВыборкаРеквизитовЗаявки;
	ВыборкаСертификатовЗаявки = ВыборкиДанных.ВыборкаСертификатовЗаявки;
	
	РеквизитыПакета = УчетныеЗаписиЭДО.НовыеРеквизитыРегистрационногоПакета();
	РеквизитыПакета.УникальныйИдентификаторЗаявки1СЭДО = ИдентификаторЗаявки;
	
	Если ВыборкаРеквизитовЗаявки.Следующий() Тогда
		ДанныеОрганизации = ИнтеграцияЭДО.РегистрационныеДанныеОрганизации(ВыборкаРеквизитовЗаявки.Организация);
		РеквизитыПакета.НаименованиеОрганизации = ДанныеОрганизации.Наименование;
		РеквизитыПакета.ИННОрганизации = ДанныеОрганизации.ИНН;
		РеквизитыПакета.КППОрганизации = ДанныеОрганизации.КПП;
		РеквизитыПакета.ОГРНОрганизации = ДанныеОрганизации.ОГРН;
		
		РеквизитыПакета.ИдентификаторОрганизации = ВыборкаРеквизитовЗаявки.ИдентификаторЭДО;
		РеквизитыПакета.ОператорЭДО = ВыборкаРеквизитовЗаявки.ПредставлениеОператораЭДО;
		РеквизитыПакета.ОператорЭДОИд = ВыборкаРеквизитовЗаявки.ОператорЭДО;
		РеквизитыПакета.ЭлектроннаяПочта = ВыборкаРеквизитовЗаявки.ЭлектроннаяПочта;
		
		ПараметрыСертификатов = КриптографияБЭД.СвойстваСертификатов(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаРеквизитовЗаявки.СертификатПодписанта));
		ПараметрыСертификата = ПараметрыСертификатов[ВыборкаРеквизитовЗаявки.СертификатПодписанта];
		
		РеквизитыПакета.Фамилия = ПараметрыСертификата.Фамилия;
		РеквизитыПакета.Имя = ПараметрыСертификата.Имя;
		РеквизитыПакета.Отчество = ПараметрыСертификата.Отчество;
	КонецЕсли;
	
	Сертификаты = Новый Массив; // Массив из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
	Пока ВыборкаСертификатовЗаявки.Следующий() Цикл
		Сертификаты.Добавить(ВыборкаСертификатовЗаявки.Сертификат);
	КонецЦикла;
	
	ДвоичныеДанныеСертификатов = КриптографияБЭД.ДвоичныеДанныеСертификатов(Сертификаты);
	
	Для Каждого ДвоичныеДанныеСертификата Из ДвоичныеДанныеСертификатов Цикл
		ДанныеСертификатаBase64 = Base64Строка(ДвоичныеДанныеСертификата.Значение);
		РеквизитыПакета.Сертификат.Добавить(ДанныеСертификатаBase64);
	КонецЦикла;
	
	Возврат РеквизитыПакета;
	
КонецФункции

// Параметры:
//  ИдентификаторЗаявки - Строка
// 
// Возвращаемое значение:
//  Структура - Выборки данных для регистрационного пакета:
//  * ВыборкаРеквизитовЗаявки - ВыборкаИзРезультатаЗапроса:
//  ** Идентификатор - Строка
//  ** ИдентификаторЭДО - Строка
//  ** Организация - ОпределяемыйТип.Организация
//  ** ЭлектроннаяПочта - Строка
//  ** СертификатПодписанта - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  ** ОператорЭДО - Строка
//  ** ПредставлениеОператораЭДО - Строка
//  * ВыборкаСертификатовЗаявки - ВыборкаИзРезультатаЗапроса:
//  ** Сертификат - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.Сертификат
Функция ВыборкиДанныхДляРегистрационногоПакета(ИдентификаторЗаявки)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаявкиНаРегистрациюВЭДО.Идентификатор,
		|	ЗаявкиНаРегистрациюВЭДО.ИдентификаторЭДО,
		|	ЗаявкиНаРегистрациюВЭДО.Организация,
		|	ЗаявкиНаРегистрациюВЭДО.ОператорЭДО,
		|	ЗаявкиНаРегистрациюВЭДО.ЭлектроннаяПочта,
		|	ЗаявкиНаРегистрациюВЭДО.СертификатПодписанта,
		|	ЕСТЬNULL(ОператорыЭДО.Представление, """") КАК ПредставлениеОператораЭДО
		|ИЗ
		|	РегистрСведений.ЗаявкиНаРегистрациюВЭДО КАК ЗаявкиНаРегистрациюВЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОператорыЭДО КАК ОператорыЭДО
		|		ПО ЗаявкиНаРегистрациюВЭДО.ОператорЭДО = ОператорыЭДО.ИдентификаторОператора
		|ГДЕ
		|	ЗаявкиНаРегистрациюВЭДО.Идентификатор = &ИдентификаторЗаявки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СертификатыЗаявокНаРегистрациюВЭДО.Сертификат
		|ИЗ
		|	РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО КАК СертификатыЗаявокНаРегистрациюВЭДО
		|ГДЕ
		|	СертификатыЗаявокНаРегистрациюВЭДО.ИдентификаторЗаявки = &ИдентификаторЗаявки";
	
	Запрос.УстановитьПараметр("ИдентификаторЗаявки", ИдентификаторЗаявки);
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура;
	Результат.Вставить("ВыборкаРеквизитовЗаявки", РезультатыЗапросов[0].Выбрать());
	Результат.Вставить("ВыборкаСертификатовЗаявки", РезультатыЗапросов[1].Выбрать());
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Идентификатор - см. РегистрСведений.ЗаявкиНаРегистрациюВЭДО.Идентификатор
//  СостояниеРегистрации - Структура:
//  * ИдентификаторОрганизации - Строка
//  * Результат - Булево
//  * ОписаниеОшибки - Строка
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыЗаявокНаРегистрациюВЭДО
Функция ЗаписатьСостояниеРегистрацииЗаявки(Идентификатор, СостояниеРегистрации) Экспорт
	
	СтатусЗаявки = Перечисления.СтатусыЗаявокНаРегистрациюВЭДО.ПустаяСсылка();
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(НаборЗаписей.Метаданные().ПолноеИмя());
	ЭлементБлокировки.УстановитьЗначение("Идентификатор", Идентификатор);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			Ошибка = СтрШаблон(НСтр("ru = 'Не найдена заявка на регистрацию в ЭДО с идентификатором %1'"), Идентификатор);
			ВызватьИсключение Ошибка;
		КонецЕсли;
		
		ЗаписьНабора = НаборЗаписей[0];
		
		Если ЗначениеЗаполнено(СостояниеРегистрации.ИдентификаторОрганизации) Тогда
			ЗаписьНабора.ИдентификаторЭДО = СостояниеРегистрации.ИдентификаторОрганизации;
			ЗаписьНабора.Статус = Перечисления.СтатусыЗаявокНаРегистрациюВЭДО.Выполнена;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СостояниеРегистрации.ОписаниеОшибки) Тогда
			ЗаписьНабора.ПричинаОтклонения = СостояниеРегистрации.ОписаниеОшибки;
			ЗаписьНабора.Статус = Перечисления.СтатусыЗаявокНаРегистрациюВЭДО.Отклонена;
		КонецЕсли;
		
		НаборЗаписей.Записать();
		
		СтатусЗаявки = ЗаписьНабора.Статус;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат СтатусЗаявки;
	
КонецФункции

// Параметры:
//  ИдентификаторЗаявки - Строка
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//  * Статус - ПеречислениеСсылка.СтатусыЗаявокНаРегистрациюВЭДО
//  * ДанныеЗаявки - ХранилищеЗначения
//  * ДанныеСоглашения - ХранилищеЗначения
//  * СертификатПодписанта - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  * ОтпечатокСертификата - Строка
//  * Доверенность - Неопределено,СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//   
Функция ВыборкаДанныхДляПодписания(ИдентификаторЗаявки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаявкиНаРегистрациюВЭДО.Статус,
		|	ЗаявкиНаРегистрациюВЭДО.ДанныеЗаявки,
		|	ЗаявкиНаРегистрациюВЭДО.ДанныеСоглашения,
		|	ЗаявкиНаРегистрациюВЭДО.СертификатПодписанта,
		|	ЕСТЬNULL(СертификатыКлючейЭлектроннойПодписиИШифрования.Отпечаток, """") КАК ОтпечатокСертификата,
		|	ЕСТЬNULL(СертификатыЗаявокНаРегистрациюВЭДО.Доверенность, НЕОПРЕДЕЛЕНО) КАК Доверенность
		|ИЗ
		|	РегистрСведений.ЗаявкиНаРегистрациюВЭДО КАК ЗаявкиНаРегистрациюВЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО КАК СертификатыЗаявокНаРегистрациюВЭДО
		|		ПО ЗаявкиНаРегистрациюВЭДО.Идентификатор = СертификатыЗаявокНаРегистрациюВЭДО.ИдентификаторЗаявки
		|		И ЗаявкиНаРегистрациюВЭДО.СертификатПодписанта = СертификатыЗаявокНаРегистрациюВЭДО.Сертификат
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования КАК
		|			СертификатыКлючейЭлектроннойПодписиИШифрования
		|		ПО ЗаявкиНаРегистрациюВЭДО.СертификатПодписанта = СертификатыКлючейЭлектроннойПодписиИШифрования.Ссылка
		|ГДЕ
		|	ЗаявкиНаРегистрациюВЭДО.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторЗаявки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка;
	
КонецФункции

// Параметры:
//  ИдентификаторЗаявки - см. РегистрСведений.ЗаявкиНаРегистрациюВЭДО.Идентификатор
Процедура ЗаписатьУчетнуюЗаписьЭДОПоЗаявке(ИдентификаторЗаявки) Экспорт
	
	ОписаниеУчетнойЗаписиЭДО = ОписаниеУчетнойЗаписиЭДОПоЗаявке(ИдентификаторЗаявки);
	
	ЕстьУчетнаяЗапись = УчетныеЗаписиЭДО.ЕстьУчетнаяЗапись(ОписаниеУчетнойЗаписиЭДО.Идентификатор);
	Если ЕстьУчетнаяЗапись Тогда
		ОбновитьУчетнуюЗаписьЭДО(ОписаниеУчетнойЗаписиЭДО);
	Иначе
		УчетныеЗаписиЭДО.СоздатьУчетнуюЗапись(ОписаниеУчетнойЗаписиЭДО);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ОписаниеУчетнойЗаписиЭДО - см. ОписаниеУчетнойЗаписиЭДОПоЗаявке
Процедура ОбновитьУчетнуюЗаписьЭДО(ОписаниеУчетнойЗаписиЭДО)
	
	ИдентификаторЭДО = ОписаниеУчетнойЗаписиЭДО.Идентификатор;
	
	НаборЗаписей = РегистрыСведений.УчетныеЗаписиЭДО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЭДО.Установить(ИдентификаторЭДО);
	
	Сертификаты = ОписаниеУчетнойЗаписиЭДО.Сертификаты;
	СвойстваСертификатов = КриптографияБЭД.СвойстваСертификатов(Сертификаты);
	Доверенности = ОписаниеУчетнойЗаписиЭДО.Доверенности;
	Должности = ОписаниеУчетнойЗаписиЭДО.Должности;
	
	НаборЗаписейСертификатов = РегистрыСведений.СертификатыУчетныхЗаписейЭДО.СоздатьНаборЗаписей();
	НаборЗаписейСертификатов.Отбор.ИдентификаторЭДО.Установить(ИдентификаторЭДО);
	
	Для Каждого Сертификат Из Сертификаты Цикл
		
		ЗаписьНабораСертификатов = НаборЗаписейСертификатов.Добавить();
		ЗаписьНабораСертификатов.ИдентификаторЭДО = ИдентификаторЭДО;
		ЗаписьНабораСертификатов.Сертификат = Сертификат;
		
		Доверенность = Доверенности[Сертификат];
		Если Доверенность <> Неопределено Тогда
			ЗаписьНабораСертификатов.Доверенность = Доверенность;
		КонецЕсли;
		
		СвойстваСертификата = СвойстваСертификатов[Сертификат];
		Если СвойстваСертификата <> Неопределено Тогда
			ЗаписьНабораСертификатов.ДействителенДо = СвойстваСертификата.ДействителенДо;
		КонецЕсли;
		
		Должность = Должности[Сертификат];
		Если Должность <> Неопределено Тогда
			ЗаписьНабораСертификатов.Должность = Должность;
		КонецЕсли;
		
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() Тогда
			ЗаписьНабора = НаборЗаписей[0];
		Иначе
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаписьНабора.ИдентификаторЭДО = ИдентификаторЭДО;
			ЗаписьНабора.ОператорЭДО = ОписаниеУчетнойЗаписиЭДО.Оператор;
			ЗаписьНабора.СпособОбменаЭД = ОписаниеУчетнойЗаписиЭДО.СпособОбмена;
			ЗаписьНабора.Организация = ОписаниеУчетнойЗаписиЭДО.Организация;
			ЗаписьНабора.НаименованиеУчетнойЗаписи = СтрШаблон(НСтр("ru = '%1, %2'"),
				ОписаниеУчетнойЗаписиЭДО.Организация, ОписаниеУчетнойЗаписиЭДО.СпособОбмена);
			ЗаписьНабора.ВерсияКонфигурации = Метаданные.Версия;
		КонецЕсли;
		
		ЗаписьНабора.АдресОрганизации = ОписаниеУчетнойЗаписиЭДО.АдресОрганизации;
		ЗаписьНабора.АдресОрганизацииЗначение = ОписаниеУчетнойЗаписиЭДО.АдресОрганизацииЗначение;
		ЗаписьНабора.КодНалоговогоОргана = ОписаниеУчетнойЗаписиЭДО.КодНалоговогоОргана;
		ЗаписьНабора.ПринятыУсловияИспользования = Истина;
		
		НаборЗаписей.Записать();
		
		НаборЗаписейСертификатов.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение
	КонецПопытки;
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЗаявки - Строка
// 
// Возвращаемое значение:
//  См. УчетныеЗаписиЭДОКлиентСервер.НовоеОписаниеУчетнойЗаписи
Функция ОписаниеУчетнойЗаписиЭДОПоЗаявке(ИдентификаторЗаявки)
	
	ОписаниеУчетнойЗаписиЭДО = УчетныеЗаписиЭДОКлиентСервер.НовоеОписаниеУчетнойЗаписи();
	
	ДанныеЗаявки = ДанныеЗаявкиДляОписанияУчетнойЗаписиЭДО(ИдентификаторЗаявки);
	
	ВыборкаРеквизитов = ДанныеЗаявки.ВыборкаРеквизитов;
	
	ВыборкаРеквизитов.Следующий();
	
	ОписаниеУчетнойЗаписиЭДО.Идентификатор = ВыборкаРеквизитов.ИдентификаторЭДО;
	ОписаниеУчетнойЗаписиЭДО.Наименование = СтрШаблон(НСтр("ru = '%1, %2'"),
		ВыборкаРеквизитов.Организация, ВыборкаРеквизитов.СпособОбмена);
	ОписаниеУчетнойЗаписиЭДО.Назначение = ВыборкаРеквизитов.Назначение;
	ОписаниеУчетнойЗаписиЭДО.ПодробноеОписание = ВыборкаРеквизитов.ПодробноеОписание;
	ОписаниеУчетнойЗаписиЭДО.СпособОбмена = ВыборкаРеквизитов.СпособОбмена;
	ОписаниеУчетнойЗаписиЭДО.Оператор = ВыборкаРеквизитов.ОператорЭДО;
	ОписаниеУчетнойЗаписиЭДО.ПредставлениеОператора =
		СервисНастроекЭДО.ПредставлениеОператораЭлектронногоДокументооборота(ВыборкаРеквизитов.ОператорЭДО);
	ОписаниеУчетнойЗаписиЭДО.Организация = ВыборкаРеквизитов.Организация;
	ОписаниеУчетнойЗаписиЭДО.АдресОрганизации = ВыборкаРеквизитов.АдресОрганизации;
	ОписаниеУчетнойЗаписиЭДО.АдресОрганизацииЗначение = ВыборкаРеквизитов.АдресОрганизацииЗначение;
	ОписаниеУчетнойЗаписиЭДО.КодНалоговогоОргана = ВыборкаРеквизитов.КодНалоговогоОргана;
	ОписаниеУчетнойЗаписиЭДО.ДатаПолученияДокументов = ВыборкаРеквизитов.ДатаПолученияДокументов;
	ОписаниеУчетнойЗаписиЭДО.РежимПереходаВЦентрЭДО = ВыборкаРеквизитов.РежимПереходаВЦентрЭДО;
	
	Если Не ЗначениеЗаполнено(ВыборкаРеквизитов.АдресОрганизацииЗначение) Тогда
		ОписаниеУчетнойЗаписиЭДО.АдресОрганизацииЗначение = 
		УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(ВыборкаРеквизитов.АдресОрганизации,
			Перечисления.ТипыКонтактнойИнформации.Адрес);
	КонецЕсли;
	
	ВыборкаСертификатов = ДанныеЗаявки.ВыборкаСертификатов;
	Сертификаты = ОписаниеУчетнойЗаписиЭДО.Сертификаты;
	Доверенности = ОписаниеУчетнойЗаписиЭДО.Доверенности;
	Должности = ОписаниеУчетнойЗаписиЭДО.Должности;
	
	Пока ВыборкаСертификатов.Следующий() Цикл
		Сертификаты.Добавить(ВыборкаСертификатов.Сертификат);
		Если ЗначениеЗаполнено(ВыборкаСертификатов.Доверенность) Тогда
			Доверенности.Вставить(ВыборкаСертификатов.Сертификат, ВыборкаСертификатов.Доверенность);
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаСертификатов.Должность) Тогда
			Должности.Вставить(ВыборкаСертификатов.Сертификат, ВыборкаСертификатов.Должность);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОписаниеУчетнойЗаписиЭДО;
	
КонецФункции

// Параметры:
//  ИдентификаторЗаявки - см. РегистрСведений.ЗаявкиНаРегистрациюВЭДО.Идентификатор
// 
// Возвращаемое значение:
//  Структура:
//  * ВыборкаРеквизитов - ВыборкаИзРезультатаЗапроса:
//  ** ИдентификаторЭДО - см. РегистрСведений.ЗаявкиНаРегистрациюВЭДО.ИдентификаторЭДО
//  ** ОператорЭДО - см. РегистрСведений.ЗаявкиНаРегистрациюВЭДО.ОператорЭДО
//  ** СпособОбмена - см. РегистрСведений.ЗаявкиНаРегистрациюВЭДО.СпособОбмена
//  ** Организация - см. РегистрСведений.ЗаявкиНаРегистрациюВЭДО.Организация
//  ** АдресОрганизации - см. РегистрСведений.ЗаявкиНаРегистрациюВЭДО.АдресОрганизации
//  ** АдресОрганизацииЗначение - см. РегистрСведений.ЗаявкиНаРегистрациюВЭДО.АдресОрганизацииЗначение
//  ** КодНалоговогоОргана - см. РегистрСведений.ЗаявкиНаРегистрациюВЭДО.КодНалоговогоОргана
//  ** ЭлектроннаяПочта - см. РегистрСведений.ЗаявкиНаРегистрациюВЭДО.ЭлектроннаяПочта
//  ** Назначение - Строка
//  ** ПодробноеОписание - Строка
//  ** ДатаПолученияДокументов - Число
//  ** РежимПереходаВЦентрЭДО - Булево
//  * ВыборкаСертификатов - ВыборкаИзРезультатаЗапроса:
//  ** Сертификат - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.Сертификат
//  ** Доверенность - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.Доверенность
//  ** Должность - Строка
Функция ДанныеЗаявкиДляОписанияУчетнойЗаписиЭДО(ИдентификаторЗаявки)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаявкиНаРегистрациюВЭДО.ИдентификаторЭДО,
		|	ЗаявкиНаРегистрациюВЭДО.ОператорЭДО,
		|	ЗаявкиНаРегистрациюВЭДО.СпособОбмена,
		|	ЗаявкиНаРегистрациюВЭДО.Организация,
		|	ЗаявкиНаРегистрациюВЭДО.АдресОрганизации,
		|	ЗаявкиНаРегистрациюВЭДО.АдресОрганизацииЗначение,
		|	ЗаявкиНаРегистрациюВЭДО.КодНалоговогоОргана,
		|	ЗаявкиНаРегистрациюВЭДО.ЭлектроннаяПочта,
		|	ЗаявкиНаРегистрациюВЭДО.Назначение,
		|	ЗаявкиНаРегистрациюВЭДО.ПодробноеОписание,
		|	ЗаявкиНаРегистрациюВЭДО.ДатаПолученияДокументов,
		|	ЗаявкиНаРегистрациюВЭДО.РежимПереходаВЦентрЭДО
		|ИЗ
		|	РегистрСведений.ЗаявкиНаРегистрациюВЭДО КАК ЗаявкиНаРегистрациюВЭДО
		|ГДЕ
		|	ЗаявкиНаРегистрациюВЭДО.Идентификатор = &ИдентификаторЗаявки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СертификатыЗаявокНаРегистрациюВЭДО.Сертификат,
		|	СертификатыЗаявокНаРегистрациюВЭДО.Доверенность,
		|	СертификатыЗаявокНаРегистрациюВЭДО.Должность
		|ИЗ
		|	РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО КАК СертификатыЗаявокНаРегистрациюВЭДО
		|ГДЕ
		|	СертификатыЗаявокНаРегистрациюВЭДО.ИдентификаторЗаявки = &ИдентификаторЗаявки";
	
	Запрос.УстановитьПараметр("ИдентификаторЗаявки", ИдентификаторЗаявки);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеЗаявки = Новый Структура;
	ДанныеЗаявки.Вставить("ВыборкаРеквизитов", РезультатыЗапроса[0].Выбрать());
	ДанныеЗаявки.Вставить("ВыборкаСертификатов", РезультатыЗапроса[1].Выбрать());
	
	Возврат ДанныеЗаявки;
	
КонецФункции

// Параметры:
//  ИдентификаторЭДО - Строка
Процедура УдалитьПоИдентификаторуЭДО(ИдентификаторЭДО) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаявкиНаРегистрациюВЭДО.Идентификатор
		|ИЗ
		|	РегистрСведений.ЗаявкиНаРегистрациюВЭДО КАК ЗаявкиНаРегистрациюВЭДО
		|ГДЕ
		|	ЗаявкиНаРегистрациюВЭДО.ИдентификаторЭДО = &ИдентификаторЭДО";
	
	Запрос.УстановитьПараметр("ИдентификаторЭДО", ИдентификаторЭДО);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	Попытка
		Пока Выборка.Следующий() Цикл
			Удалить(Выборка.Идентификатор);
			РегистрыСведений.СертификатыЗаявокНаРегистрациюВЭДО.Удалить(Выборка.Идентификатор);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЗаявки - Строка
Процедура Удалить(ИдентификаторЗаявки)
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Идентификатор.Установить(ИдентификаторЗаявки);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
